---
kind: other
id: Methods.T:Autodesk.Revit.DB.SymbolicCurveArrayIterator
source: html/19ab6eb9-17af-f418-1ed6-93d4e300f091.htm
---
# SymbolicCurveArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.